##################
#
# linux_shell
#
##################

1. who 查看现在系统有多少人登录

2. wc 列出一共多少行 
wc(字数统计) -l(line行数) -w(word字数) -c(字符数)

3. | > < >> IO重定向-输出
| 管道
> IO重定向-输出
< IO重定向-输入
	patch --verbose --backup -p1 < /tmp/whi-path
	重定向输入为 从whi-path中输入
>> 附加文件
	ll >> tmp_file

4. ctrl+D 数据结束 

5. ; & 连续语句使用 
cd ../ ; ls -l | wc -l
后面语句需要等待前面语句执行结束后执行
cd ../ & ls -l | wc -l
后面的语句不需要等待前面的语句执行完就可以直接执行

6. cat 查看 
将内容输入到文件
cat > cat_file
fsafd
ctrl+D

7. #! 定义使用哪个shell 

8. 命令的选项可以合并
ls -l -t 可以合并为 ls -lt

9.shell命令分为三种
內建命令: shell本身所执行的命令。 cd,read,echo,printf等
Shell函数：功能健全的一系列代码。
外部命令：shell的副本所执行的命令，其实就是另一个/bin/sh

10.变量
var=1234

11.引号
值中包含空格
echo "$var $var"

12.转移字符
\c \a \b \f \n \r \t \\

13. printf 华丽输出
printf "the age is %d, the name is %s\n" 10 "ming zi"

14. 特殊文件 /dev/null和/dev/tty ????????????????????????????????????????????

15. -x shell追踪
sh -x update.sh
或者在文件中set -x开启追踪  set +x关闭最终

16. grep 查找文本

17. 正则表达式!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

18. sed 文字替换!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

19. cut 文本裁剪
ls -l | cut -c 1-10

10. awk 重新编排字段!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
awk '{print $1}'
awk -F: '{print $1"\t"$4"\t"$5}' /etc/passwd
awk -F: -v 'OFS="\t****\t"' '{print $1,$5}' /etc/passwd

11. sort 排序!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

12. join 拼接!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

13. tr 字符替换!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
tr 1 2 < word.txt 将1全部替换成2
tr ‘a-z’ ‘A-Z’ < word.txt	将小写a-z替换成大写的A-Z

14. 变量、判断、重复动作







